# Завдання 1
# Користувач вводить із клавіатури ціле шестизначне число. Написати програму, яка визначає, чи є введене число щасливим (щасливим вважається шестизначне число, в якого сума перших 3 цифр дорівнює сумі других трьох цифр).
# Наприклад, 123321 — щасливе число, тому що 1+2+3 = 3+2+1.
# З іншого боку 378423 — нещасливе число, оскільки 3+7+8 != 4+2+3.
# Якщо користувач ввів не шестизначне число, потрібно вивести повідомлення про помилку.

# number = int(input("User ")) # 123321

# a1 = number % 10
# a2 = number // 10 % 10
# a3 = number // 100 % 10
# a4 = number // 1000 % 10
# a5 = number // 10000 % 10
# a6 = number // 100000 
# if (a1+a2+a3) == (a4+a5+a6):
#     print('Щастливе')
# else:
#     print('Не щастливе')


# number = int(input("User ")) 

# if len(str(number)) == 6:
#     a1 = number % 10
#     a2 = number // 10 % 10
#     a3 = number // 100 % 10
#     a4 = number // 1000 % 10
#     a5 = number // 10000 % 10
#     a6 = number // 100000
#     result = str(a1) + str(a2) + str(a4) + str(a3) + str(a5) + str(a6)
#     result = int(result)
#     print(result)
#     print(type(result))
# else:
#     print('Error')

# Завдання 2
# Користувач вводить ціле число. Написати програму, яка виводить число, яке зібране з числа (якщо число має тільки одну цифру, то виводить це число; якщо число має дві цифри, то виводить суму цих цифр; якщо число ма три цифри, то виводить суму цих цифр, якщо число має четири цифри, то виводить суму цих цифр).
# Якщо користувач ввів число 123, то виводить суму цифр: 1+2+3 = 6.

number = input("User ")

if len(number) == 1:
    print(number)
elif len(number) == 2:
    a1 = int(number) % 10
    a2 = int(number) // 10
    print(a1+a2)
elif len(number) == 3:
    a1 = int(number) % 10
    a2 = int(number) // 10 % 10
    a3 = int(number) // 100
    print(a1+a2+a3)

a = 3
if a > 2:
    res = a ** a
else:
    res = a + a

res = a ** a if a > 2 else a + a

